In [1]:
import pandas as pd
import numpy as np

In [2]:
baseClientes = pd.read_excel(r"C:\Users\Victor\Downloads\clientes.xlsx")
baseAuto = pd.read_excel(r"C:\Users\Victor\Downloads\auto.xlsx")
baseAuto.rename(columns = {'id_cliente':'id_client'}, inplace=True)

In [3]:
baseClientes.head()

,id_client,age,monthly_income,city,state,gender,education_level,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,1000,61.0,NaN,NaN,NaN,male,NaN,NaN,NaN,NaN
1,1001,50.0,NaN,False,MG,NaN,NaN,NaN,NaN,NaN
2,1002,31.0,NaN,False,MG,male,NaN,NaN,NaN,NaN
3,1003,51.0,NaN,False,SP,male,NaN,NaN,NaN,NaN
4,1004,51.0,NaN,False,RS,male,NaN,NaN,NaN,NaN

In [4]:
baseClientes['state'].value_counts()

SP           13830
MG            3177
RJ            3052
PR            2258
RS            1631
SC            1566
GO            1036
DF            1025
BA            1006
PE             777
CE             770
MT             573
MS             559
AM             487
ES             484
PA             475
RN             376
MA             356
PB             349
AL             229
RO             217
PI             197
SE             181
TO             171
AC              96
AP              92
RR              56
 epitacio        1
Curitiba         1
Limeira          1
False            1
Name: state, dtype: int64

In [5]:
baseClientes['state'].unique()

array([nan, 'MG', 'SP', 'RS', 'RJ', 'PR', 'AM', 'MA', 'BA', 'SC', 'PE',
       'AP', 'PB', 'MT', 'DF', 'CE', 'ES', 'AC', 'PI', 'GO', 'PA', 'RN',
       'AL', 'MS', 'RO', 'TO', 'RR', 'SE', 'Limeira', 'Curitiba',
       ' epitacio', False], dtype=object)

## 1) Qual a média salarial dos clientes para cada estado do sudeste?

In [6]:
baseClientes[baseClientes['state']=='SP']['monthly_income'].mean()

3839.4105263157894

In [7]:
baseClientes[baseClientes['state']=='RJ']['monthly_income'].mean()

4600.484848484848

In [8]:
baseClientes[baseClientes['state']=='MG']['monthly_income'].mean()

3323.5333333333333

In [9]:
baseClientes[baseClientes['state']=='ES']['monthly_income'].mean()

3806.6666666666665

## 2) Qual o maior salário? E o menor?

Para valores máximos:

In [10]:
baseClientes[baseClientes['state']=='SP']['monthly_income'].max()

29300.0

In [11]:
baseClientes[baseClientes['state']=='RJ']['monthly_income'].max()

40000.0

In [12]:
baseClientes[baseClientes['state']=='MG']['monthly_income'].max()

5000.0

In [13]:
baseClientes[baseClientes['state']=='ES']['monthly_income'].max()

5420.0

Para valores mínimos:

In [14]:
baseClientes[baseClientes['state']=='SP']['monthly_income'].min()

1000.0

In [15]:
baseClientes[baseClientes['state']=='RJ']['monthly_income'].min()

1200.0

In [16]:
baseClientes[baseClientes['state']=='MG']['monthly_income'].min()

1187.0

In [17]:
baseClientes[baseClientes['state']=='ES']['monthly_income'].min()

2800.0

## 3) Qual o percentual de clientes acima de 60 anos? (Responda com precisão de duas casas decimais)

In [18]:
baseClientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35033 entries, 0 to 35032
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_client        35033 non-null  int64
 1   age              35031 non-null  float64
 2   monthly_income   250 non-null    float64
 3   city             35001 non-null  object
 4   state            35030 non-null  object
 5   gender           31082 non-null  object
 6   education_level  19897 non-null  object
 7   Unnamed: 7       11342 non-null  object
 8   Unnamed: 8       19 non-null     float64
 9   Unnamed: 9       19 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 2.7+ MB

In [19]:
baseClientes[baseClientes['age']>60]

,id_client,age,monthly_income,city,state,gender,education_level,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,1000,61.0,NaN,NaN,NaN,male,NaN,NaN,NaN,NaN
6,1006,63.0,NaN,False,SP,male,NaN,NaN,NaN,NaN
16,1016,63.0,NaN,Londrina,PR,male,NaN,NaN,NaN,NaN
17,1017,64.0,NaN,False,MA,male,NaN,NaN,NaN,NaN
42,1042,63.0,NaN,False,SP,male,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
34945,35945,63.0,NaN,Novo Hamburgo,RS,female,False,False,NaN,NaN
34983,35983,62.0,NaN,False,DF,female,NaN,NaN,NaN,NaN
34985,35985,63.0,NaN,False,SC,female,NaN,NaN,NaN,NaN
34997,35997,81.0,NaN,Rio de Janeiro,RJ,NaN,NaN,NaN,NaN,NaN
34998,35998,61.0,NaN,Buri,SP,female,False,NaN,NaN,NaN

In [20]:
percentual = (1597*100)/35031

In [21]:
round(percentual, 2)

4.56

## 4) Relacione as cidades dos clientes com seus carros. Qual cidade possui mais carros da marca Ford?

In [22]:
bases = pd.merge(baseClientes, baseAuto, on='id_client')

In [23]:
bases.head()

,id_client,age,monthly_income,city,state,gender,education_level,Unnamed: 7,Unnamed: 8,Unnamed: 9,auto_id,auto_brand,auto_model,auto_year,auto_value
0,1000,61.0,NaN,NaN,NaN,male,NaN,NaN,NaN,NaN,2009GM26099,GM - Chevrolet,Vectra GT 2.0 MPFI 8V FlexPower Mec.,2009,27000
1,1001,50.0,NaN,False,MG,NaN,NaN,NaN,NaN,NaN,2006VW12181,VW - VolksWagen,Polo 1.6 Mi/S.Ouro 1.6 Mi Tot.Flex 8V 5p,2006,20000
2,1002,31.0,NaN,False,MG,male,NaN,NaN,NaN,NaN,2011VW8956,VW - VolksWagen,Saveiro CROSS 1.6 Mi Total Flex 8V CE,2011,32000
3,1003,51.0,NaN,False,SP,male,NaN,NaN,NaN,NaN,2002Fi24821,Fiat,Palio Young 1.0 mpi 8v 4p,2002,11000
4,1004,51.0,NaN,False,RS,male,NaN,NaN,NaN,NaN,2004GM13919,GM - Chevrolet,Vectra CD 2.2 16V / 2.0 16V Mec./Aut.,2004,20000

In [24]:
bases[bases['auto_brand']=='Ford']['city'].value_counts()

False             1718
Rio de Janeiro     163
Curitiba            71
Belo Horizonte      71
Guarulhos           57
                  ...
Taquaralto           1
sorocaba             1
POMERODE             1
Lagoa Seca           1
Rio das ostras       1
Name: city, Length: 616, dtype: int64

## 5) Quantas cidades distintas existem dentre os clientes do RS e quais são elas?

In [25]:
baseClientes[baseClientes['state']=='RS']['city'].value_counts()

False              367
Porto Alegre       282
Caxias do Sul      129
Canoas              68
Santa Maria         45
                  ...
Unistalda            1
Fazenda Souza        1
Itaqui               1
Arroio do Padre      1
gravatai             1
Name: city, Length: 197, dtype: int64

In [26]:
baseClientes[baseClientes['state']=='RS']['city'].nunique()

197